graph graph (
  %input0[INT64, 1]
  %input1[INT64, 1]
  %input2[INT64, 1]
) {
  %1 = Sub(%input0, %input1)
  %2 = Add(%input0, %input1)
  %3_out = Add(%1, %input1)
  %4 = Sub(%1, %input1)
  %5_out = Add(%2, %4)
  %6_out = Add(%input1, %input2)
  return %3_out, %5_out, %6_out
}